code/openfoam/tutorials/incompressibleFluid/wingMotion/wingMotion2D_steady/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 0;

boundaryField
{
    wing
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "(front|back|topAndBottom|inlet|outlet)"
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
